---
type: MassSurfaceData
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 19
tags: [revit-api, class]
---

# MassSurfaceData

`Autodesk.Revit.DB.Analysis.MassSurfaceData` · Revit 2024 · 19 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetFaceReferences | 2012 | `public IList < Reference > GetFaceReferences ()` |
| Property | Area | 2012 | `public double Area { get ; }` |
| Property | CategoryIdForConceptualSurfaceType | 2012 | `public ElementId CategoryIdForConceptualSurfaceType { get ; }` |
| Property | ConceptualConstructionId | 2012 | `public ElementId ConceptualConstructionId { get ; set ; }` |
| Property | IsConceptualConstructionByEnergyData | 2012 | `public bool IsConceptualConstructionByEnergyData { get ; set ; }` |
| Property | IsGlazingShaded | 2012 | `public bool IsGlazingShaded { get ; set ; }` |
| Property | IsSlab | 2012 | `public bool IsSlab { get ; }` |
| Property | IsUnderground | 2012 | `public bool IsUnderground { get ; set ; }` |
| Property | MassLevelDataId | 2012 | `public ElementId MassLevelDataId { get ; }` |
| Property | MaterialId | 2012 | `public ElementId MaterialId { get ; set ; }` |
| Property | MaterialType | 2012 | `public MassSurfaceDataMaterialType MaterialType { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | PercentageGlazing | 2012 | `public double PercentageGlazing { get ; set ; }` |
| Property | PercentageSkylights | 2012 | `public double PercentageSkylights { get ; set ; }` |
| Property | ReferenceElementId | 2012 | `public ElementId ReferenceElementId { get ; }` |
| Property | ShadeDepth | 2012 | `public double ShadeDepth { get ; set ; }` |
| Property | SillHeight | 2012 | `public double SillHeight { get ; set ; }` |
| Property | SkylightWidth | 2012 | `public double SkylightWidth { get ; set ; }` |
| Property | SurfaceDataSource | 2012 | `public MassSurfaceDataSource SurfaceDataSource { get ; set ; }` |